Seeed-Studio/CodeCraft/main/compilers/mac/arduino/contents/hardware/Seeeduino/hardware/samd/1.8.2/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.role=Role
menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug
menu.txrxled=TX/RX LED

# Seeed Wio Terminal (SAMD51)
# ------------------------------
seeed_wio_terminal.name=Seeeduino Wio Terminal
seeed_wio_terminal.vid.0=0x2886
seeed_wio_terminal.pid.0=0x802D
seeed_wio_terminal.vid.1=0x2886
seeed_wio_terminal.pid.1=0x002D
seeed_wio_terminal.upload.tool=bossac18
seeed_wio_terminal.upload.protocol=sam-ba
seeed_wio_terminal.upload.maximum_size=507904
seeed_wio_terminal.upload.offset=0x4000
seeed_wio_terminal.upload.use_1200bps_touch=true
seeed_wio_terminal.upload.wait_for_upload_port=true
seeed_wio_terminal.upload.native_usb=true
seeed_wio_terminal.build.mcu=cortex-m4
#seeed_wio_terminal.build.f_cpu=120000000L
seeed_wio_terminal.build.usb_product="Seeed Wio Terminal"
seeed_wio_terminal.build.usb_manufacturer="Seeed Studio"
seeed_wio_terminal.build.board=WIO_TERMINAL
seeed_wio_terminal.build.core=arduino
seeed_wio_terminal.build.extra_flags=-D__SAMD51P19A__ -DWIO_TERMINAL -DSEEED_WIO_TERMINAL -DSEEED_GROVE_UI_WIRELESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
seeed_wio_terminal.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
seeed_wio_terminal.build.openocdscript=openocd_scripts/arduino_zero.cfg
seeed_wio_terminal.build.variant=wio_terminal
seeed_wio_terminal.build.variant_system_lib=
seeed_wio_terminal.build.vid=0x2886
seeed_wio_terminal.build.pid=0x802D
seeed_wio_terminal.bootloader.tool=openocd
seeed_wio_terminal.bootloader.file=wio_terminal/bootloader-wio-terminal.bin
seeed_wio_terminal.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.7.0.path}/CMSIS/DSP/Lib/GCC/" -larm_cortexM4lf_math -lm -mfloat-abi=hard -mfpu=fpv4-sp-d16
seeed_wio_terminal.menu.role.master=Master
seeed_wio_terminal.menu.role.master.build.flags.role=-DROLE=0
seeed_wio_terminal.menu.role.slave=Slave
seeed_wio_terminal.menu.role.slave.build.flags.role=-DROLE=1
seeed_wio_terminal.menu.cache.on=Enabled
seeed_wio_terminal.menu.cache.on.build.cache_flags=-DENABLE_CACHE
seeed_wio_terminal.menu.cache.off=Disabled
seeed_wio_terminal.menu.cache.off.build.cache_flags=
seeed_wio_terminal.menu.speed.120=120 MHz (standard)
seeed_wio_terminal.menu.speed.120.build.f_cpu=120000000L
seeed_wio_terminal.menu.speed.150=150 MHz (overclock)
seeed_wio_terminal.menu.speed.150.build.f_cpu=150000000L
seeed_wio_terminal.menu.speed.180=180 MHz (overclock)
seeed_wio_terminal.menu.speed.180.build.f_cpu=180000000L
seeed_wio_terminal.menu.speed.200=200 MHz (overclock)
seeed_wio_terminal.menu.speed.200.build.f_cpu=200000000L
seeed_wio_terminal.menu.opt.small=Small (-Os) (standard)
seeed_wio_terminal.menu.opt.small.build.flags.optimize=-Os
seeed_wio_terminal.menu.opt.fast=Fast (-O2)
seeed_wio_terminal.menu.opt.fast.build.flags.optimize=-O2
seeed_wio_terminal.menu.opt.faster=Faster (-O3)
seeed_wio_terminal.menu.opt.faster.build.flags.optimize=-O3
seeed_wio_terminal.menu.opt.fastest=Fastest (-Ofast)
seeed_wio_terminal.menu.opt.fastest.build.flags.optimize=-Ofast
seeed_wio_terminal.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
seeed_wio_terminal.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
seeed_wio_terminal.menu.maxqspi.50=50 MHz (standard)
seeed_wio_terminal.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
seeed_wio_terminal.menu.maxqspi.fcpu=CPU Speed / 2
seeed_wio_terminal.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
seeed_wio_terminal.menu.usbstack.arduino=Arduino
seeed_wio_terminal.menu.usbstack.tinyusb=TinyUSB
seeed_wio_terminal.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
seeed_wio_terminal.menu.debug.off=Off
seeed_wio_terminal.menu.debug.on=On
seeed_wio_terminal.menu.debug.on.build.flags.debug=-g -DDEBUG=1
seeed_wio_terminal.menu.txrxled.on=On
seeed_wio_terminal.menu.txrxled.off=Off
seeed_wio_terminal.menu.txrxled.on.build.flags.txrxled=-DTXRXLED_ENABLE

# Seeed Femto M0 (SAMD21)
# ------------------------------
Seeed_femto_m0.name=Seeeduino Femto
Seeed_femto_m0.vid.0=0x2886
Seeed_femto_m0.pid.0=0x802C
Seeed_femto_m0.vid.1=0x2886
Seeed_femto_m0.pid.1=0x002C
Seeed_femto_m0.upload.tool=bossac
Seeed_femto_m0.upload.protocol=sam-ba
Seeed_femto_m0.upload.maximum_size=262144
Seeed_femto_m0.upload.offset=0x2000
Seeed_femto_m0.upload.use_1200bps_touch=true
Seeed_femto_m0.upload.wait_for_upload_port=true
Seeed_femto_m0.upload.native_usb=true
Seeed_femto_m0.build.mcu=cortex-m0plus
Seeed_femto_m0.build.f_cpu=48000000L
Seeed_femto_m0.build.usb_product="Seeed femto M0"
Seeed_femto_m0.build.usb_manufacturer="Seeed"
Seeed_femto_m0.build.board=SEEED_FEMTO_M0
Seeed_femto_m0.build.core=arduino
Seeed_femto_m0.build.extra_flags=-DCRYSTALLESS -D__SAMD21__ -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS -DSEEED_FEMTO_M0 {build.usb_flags}
Seeed_femto_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Seeed_femto_m0.build.openocdscript=openocd_scripts/femto_m0.cfg
Seeed_femto_m0.build.variant=femto_m0
Seeed_femto_m0.build.variant_system_lib=
Seeed_femto_m0.build.vid=0x2886
Seeed_femto_m0.build.pid=0x802C
Seeed_femto_m0.bootloader.tool=openocd
Seeed_femto_m0.bootloader.file=femtoM0/bootloader-femto_m0-v3.7.0-31-seeeduino.bin
Seeed_femto_m0.menu.usbstack.arduino=Arduino
Seeed_femto_m0.menu.usbstack.tinyusb=TinyUSB
Seeed_femto_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
Seeed_femto_m0.menu.debug.off=Off
Seeed_femto_m0.menu.debug.on=On
Seeed_femto_m0.menu.debug.on.build.flags.debug=-g -DDEBUG=1

# Seeed XIAO M0 (SAMD21)
# ------------------------------
seeed_XIAO_m0.name=Seeeduino XIAO
seeed_XIAO_m0.vid.0=0x2886
seeed_XIAO_m0.pid.0=0x802F
seeed_XIAO_m0.vid.1=0x2886
seeed_XIAO_m0.pid.1=0x002F
seeed_XIAO_m0.upload.tool=bossac
seeed_XIAO_m0.upload.protocol=sam-ba
seeed_XIAO_m0.upload.maximum_size=262144
seeed_XIAO_m0.upload.offset=0x2000
seeed_XIAO_m0.upload.use_1200bps_touch=true
seeed_XIAO_m0.upload.wait_for_upload_port=true
seeed_XIAO_m0.upload.native_usb=true
seeed_XIAO_m0.build.mcu=cortex-m0plus
seeed_XIAO_m0.build.f_cpu=48000000L
seeed_XIAO_m0.build.usb_product="Seeed XIAO M0"
seeed_XIAO_m0.build.usb_manufacturer="Seeed"
seeed_XIAO_m0.build.board=SEEED_XIAO_M0
seeed_XIAO_m0.build.core=arduino
seeed_XIAO_m0.build.extra_flags= -DARDUINO_SAMD_ZERO -D__SAMD21__ -D__SAMD21G18A__ -DARM_MATH_CM0PLUS -DSEEED_XIAO_M0 {build.usb_flags}
seeed_XIAO_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
seeed_XIAO_m0.build.openocdscript=openocd_scripts/XIAO_m0.cfg
seeed_XIAO_m0.build.variant=XIAO_m0
seeed_XIAO_m0.build.variant_system_lib=
seeed_XIAO_m0.build.vid=0x2886
seeed_XIAO_m0.build.pid=0x802F
seeed_XIAO_m0.bootloader.tool=openocd
seeed_XIAO_m0.bootloader.file=XIAOM0/bootloader-XIAO_m0-v3.7.0-33-g90ff611-dirty.bin
seeed_XIAO_m0.menu.usbstack.arduino=Arduino
seeed_XIAO_m0.menu.usbstack.tinyusb=TinyUSB
seeed_XIAO_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
seeed_XIAO_m0.menu.debug.off=Off
seeed_XIAO_m0.menu.debug.on=On
seeed_XIAO_m0.menu.debug.on.build.flags.debug=-g -DDEBUG=1


# Seeed XIAO M0 (SAMD21)
# ------------------------------
Wio_Lite_MG126.name=Seeeduino Wio lite MG126
Wio_Lite_MG126.vid.0=0x2886
Wio_Lite_MG126.pid.0=0x802A
Wio_Lite_MG126.vid.1=0x2886
Wio_Lite_MG126.pid.1=0x002A
Wio_Lite_MG126.upload.tool=bossac
Wio_Lite_MG126.upload.protocol=sam-ba
Wio_Lite_MG126.upload.maximum_size=262144
Wio_Lite_MG126.upload.offset=0x2000
Wio_Lite_MG126.upload.use_1200bps_touch=true
Wio_Lite_MG126.upload.wait_for_upload_port=true
Wio_Lite_MG126.upload.native_usb=true
Wio_Lite_MG126.build.mcu=cortex-m0plus
Wio_Lite_MG126.build.f_cpu=48000000L
Wio_Lite_MG126.build.usb_product="Seeeduino_Wio_Lite_MG126"
Wio_Lite_MG126.build.usb_manufacturer="Seeed"
Wio_Lite_MG126.build.board=Wio_Lite_MG126
Wio_Lite_MG126.build.core=arduino
Wio_Lite_MG126.build.extra_flags= -DARDUINO_SAMD_ZERO -D__SAMD21__ -D__SAMD21G18A__ -DARM_MATH_CM0PLUS -DWio_Lite_MG126 {build.usb_flags}
Wio_Lite_MG126.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Wio_Lite_MG126.build.openocdscript=openocd_scripts/Wio_Lite_MG126.cfg
Wio_Lite_MG126.build.variant=Wio_Lite_MG126
Wio_Lite_MG126.build.variant_system_lib=
Wio_Lite_MG126.build.vid=0x2886
Wio_Lite_MG126.build.pid=0x802A
Wio_Lite_MG126.bootloader.tool=openocd
Wio_Lite_MG126.bootloader.file=Wio_Lite_MG126/Bootloader_D21.hex
Wio_Lite_MG126.menu.usbstack.arduino=Arduino
Wio_Lite_MG126.menu.usbstack.tinyusb=TinyUSB
Wio_Lite_MG126.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
Wio_Lite_MG126.menu.debug.off=Off
Wio_Lite_MG126.menu.debug.on=On
Wio_Lite_MG126.menu.debug.on.build.flags.debug=-g -DDEBUG=1


